package Enkap_constructor_HashCode_toString_equals;

//HashCode-присваивает обьектам целочисленное int значение что можнт упрастить сравнение обьектов
//если цифровое представление 2х обьектов будет разным то обьекты не равны.

//числовые значения ограничены поэтому чожет произойти КОЛЛИЗИЯ -ситуация когда разные обьекты имеют одинаковый HashCode
//есди обьекты равны по equals то их HashCode тоже должны быть одинаковыми.
//так же обьекту присваивается только один HashCode и он не меняется ни при обновлении ни при повторном вызове
public class HashCode {

}
